## Data visualization with Plot

In [144]:
import numpy as np
import pandas as pd
import matplotlib as plt

In [145]:
# Define some values
infos = [['Kesnel','Samuel','kes@gmail.com',25,'Delmas','Lycee Haiti',3.34,7.11,3.34],
    ['Jhonny','Klay','jklay@yahoo.com',18,'PV','College prive',5.01,6.23,6.34],
    ['Weezy','Peter','wp@gmail.com',67,'NYC','High School Levis',np.nan,3.45,8.31],
    ['Sabine','Jean-Philippe','bibine509@outlook.com',12,'Delmas','Lycee Jean Paul',5.74,4.53,7.63],
    ['Herold','Samuel','hsam@yahoo.fr',25,'Jacmel','School of zone',3.32,4.12],
    ['Julie','Cesar','juliec@gmail.com',11,'Cap Haitian','College Catts Jean',6.34,3.21,9.92],
    ['Ketty','Mars','marsyqueen@hotmail.com',34,'Canada','College of Ottawa',2.34,5.23,4.65],
    ['Tony','Griffin','tong@hotmail.com',18,'New Jersey','High private School',5.67,3.42,3.67],
    ['David','Dobrik','dave509@studio.com',26,'Las vegas','Private learning center',2.45,4.87,5.43],
    ['Liza','Koshy','lizakoshy@outlook.com',24,'California','Beverly community of school',2.34,3.4]]

col = ['Nom','Prenom','email','Age','Localisation','School','Trimester 1','Trimester 2','Trimester 3']

In [146]:
# Making the DataFrame
df = pd.DataFrame(data=infos, columns=col)
df

,Nom,Prenom,email,Age,Localisation,School,Trimester 1,Trimester 2,Trimester 3
0,Kesnel,Samuel,kes@gmail.com,25,Delmas,Lycee Haiti,3.34,7.11,3.34
1,Jhonny,Klay,jklay@yahoo.com,18,PV,College prive,5.01,6.23,6.34
2,Weezy,Peter,wp@gmail.com,67,NYC,High School Levis,NaN,3.45,8.31
3,Sabine,Jean-Philippe,bibine509@outlook.com,12,Delmas,Lycee Jean Paul,5.74,4.53,7.63
4,Herold,Samuel,hsam@yahoo.fr,25,Jacmel,School of zone,3.32,4.12,NaN
5,Julie,Cesar,juliec@gmail.com,11,Cap Haitian,College Catts Jean,6.34,3.21,9.92
6,Ketty,Mars,marsyqueen@hotmail.com,34,Canada,College of Ottawa,2.34,5.23,4.65
7,Tony,Griffin,tong@hotmail.com,18,New Jersey,High private School,5.67,3.42,3.67
8,David,Dobrik,dave509@studio.com,26,Las vegas,Private learning center,2.45,4.87,5.43
9,Liza,Koshy,lizakoshy@outlook.com,24,California,Beverly community of school,2.34,3.40,NaN

In [147]:
# Export the Dataframe as Csv file
df.to_csv('data/school_dataframe.csv')

## Let's see how many student passed the examens for each Trimester

> #### Trimester 1

In [148]:
# Make a filter to see all specified students for the first trimester
filt = (df['Trimester 1'] >= 5)
df.loc[filt, ['Nom', 'Prenom','Trimester 1']].sort_values(by='Trimester 1', ascending=False).head(3)

      Nom         Prenom  Trimester 1
5   Julie          Cesar         6.34
3  Sabine  Jean-Philippe         5.74
7    Tony        Griffin         5.67

In [149]:
# Make a filter to see all specified students for the second trimester
filt = (df['Trimester 2'] >= 5)
df.loc[filt, ['Nom', 'Prenom','Trimester 2']].sort_values(by='Trimester 2', ascending=False).head(3)

      Nom  Prenom  Trimester 2
0  Kesnel  Samuel         7.11
1  Jhonny    Klay         6.23
6   Ketty    Mars         5.23

In [150]:
# Make a filter to see all specified students for the last trimester
filt = (df['Trimester 3'] >= 5)
df.loc[filt, ['Nom', 'Prenom','Trimester 3']].sort_values(by='Trimester 3', ascending=False).head(3)

      Nom         Prenom  Trimester 3
5   Julie          Cesar         9.92
2   Weezy          Peter         8.31
3  Sabine  Jean-Philippe         7.63

##### **Conclusion** our best 3 students for the first trimester are: <br/> - For the first: **Julie Cesar, Sabine Jean-Philippe, Tony Griffin** <br/> - For the second: **Kesnel Samuel, Jhonny Klay, Ketty Mars** <br/> - For the last: **Julie Cesar, Weezy Peter, Sabine Jean-Philippe**

## Now we are going to check on our final score

> #### Add the sum in our dataframe, to see the final results

In [151]:
# This new column is to control all the 3 notes
df['Total'] = df[['Trimester 1','Trimester 2','Trimester 3']].sum(axis=1)
df

,Nom,Prenom,email,Age,Localisation,School,Trimester 1,Trimester 2,Trimester 3,Total
0,Kesnel,Samuel,kes@gmail.com,25,Delmas,Lycee Haiti,3.34,7.11,3.34,13.79
1,Jhonny,Klay,jklay@yahoo.com,18,PV,College prive,5.01,6.23,6.34,17.58
2,Weezy,Peter,wp@gmail.com,67,NYC,High School Levis,NaN,3.45,8.31,11.76
3,Sabine,Jean-Philippe,bibine509@outlook.com,12,Delmas,Lycee Jean Paul,5.74,4.53,7.63,17.90
4,Herold,Samuel,hsam@yahoo.fr,25,Jacmel,School of zone,3.32,4.12,NaN,7.44
5,Julie,Cesar,juliec@gmail.com,11,Cap Haitian,College Catts Jean,6.34,3.21,9.92,19.47
6,Ketty,Mars,marsyqueen@hotmail.com,34,Canada,College of Ottawa,2.34,5.23,4.65,12.22
7,Tony,Griffin,tong@hotmail.com,18,New Jersey,High private School,5.67,3.42,3.67,12.76
8,David,Dobrik,dave509@studio.com,26,Las vegas,Private learning center,2.45,4.87,5.43,12.75
9,Liza,Koshy,lizakoshy@outlook.com,24,California,Beverly community of school,2.34,3.40,NaN,5.74

In [152]:
'''
This new columns is to say if the student is passed or failed. 
Knowing that the minimun Total note a student need to pass is 15,
a student need 
'''

'\nThis new columns is to say if the student is passed or failed. \nKnowing that the minimun Total note a student need to pass is 15,\na student need \n'